import React from 'react';
import "./index.css"

class Protocol extends React.Component{
    render(){
        return(
            <div className="protocolContainer">
                <div>
                    <div className="protocolContext">
                    <h1>华光用户服务协议</h1>
                    <h2>1．释义</h2>
                    <p>本服务协议是用户与华光人工智能教育机器人创新团队（以下简称"华光"）之间的法律协议（包括但不仅限于所订立的相关权利义务规范）。</p>
                    <p>用户指愿意接受本协议，注册成为"华光"用户并使用"华光"提供的网络服务的个人。</p>
                    <p>本协议描述华光向用户提供网络服务的详细条款。因此，请于注册成为华光的用户前，确实、详细地阅读本服务协议的所有内容。当用户点选"注册"按钮或使用任何华光所提供的网络服务即视为同意并接受本服务协议的所有规范并愿受其约束。</p>
                    <p>用户应当明确：无论事实上是否在注册前认真阅读，只要用户点击"注册"按钮并按照相关注册程序成功注册，用户的行为就已表示用户无条件接受了本协议及本公司所公布的各项管理规定，并愿意受其约束。如果发生纠纷，用户不得以未仔细阅读为由实行抗辩。</p>
                    <p>另外提醒用户，本协议之规定可能随时会更改，修改本用户协议时，华光将于相关页面公告修改的事实，而不另行对用户进行个别通知，敬请定期查询。如用户不同意本服务协议及/或随时对其的修改，用户可以主动取消华光提供的服务，用户如果仍继续使用华光提供的服务即构成用户同意华光对本协议所做的所有更新内容。由于用户在用户协议变更后因未熟悉公告规定而引起的损失,华光将不会承担任何责任。</p>
                    <h2>2.权利声明</h2>
                    <p>华光所提供的服务与服务有关的全部信息、资料、文字、软件、声音、图片、视频、图表（包括相关的软件）的著作权、商标、商业秘密、其他知识产权、所有权或其他权利，除特别注明其他权利方的外，均为华光所有，受中华人民共和国相关法律及中华人民共和国加入的国际协定和国际条约保护，除非事先获得华光及/或其他权利方的书面授权，任何人不得以任何直接或间接的方式对任何该信息、资料、文字、软件、程序、声音、图片、视频、图表进行修改、拷贝、散布、传送、展示、执行、复制、发行、授权、制作衍生成果、移转、损毁、销售、租赁以及其他类似行为，而不论是否从中获得经济利益。任何人违反前述规定的，均应赔偿由此给华光及/或其他权利方造成的任何直接和间接损失，包括但不限于其向第三人进行的赔偿、支付，任何经济处罚、律师费等。</p>
                    <p>用户明确知悉且不可撤销的同意，用户使用华光于现在和将来提供之任何作品、素材、信息（包括但不限于华光编程作品等），或者通过华光于现在和将来提供之任何服务（包括但不限于编程创作工具等）创作之作品（以下称“华光衍生作品”）的著作权完全属于华光，华光可基于自身判断和需求将该等作品用于任何用途和目的，而不论是否具有商业性质，用户不对此向华光提出任何权利和经济主张。</p>
                    <p>用户在使用任何华光于现在和将来提供之作品、素材、信息的基础上创作出的任何新作品（包括但不限于衍生作品、改编作品、汇编作品、集体作品、修订作品或名称，以下统称“新作品”），均不得就该等新作品获取或声称拥有独立著作权、商标权或任何其他专有权利。</p>
                    <p>用户在使用任何华光于现在和将来提供之作品、素材、信息的基础上创作、衍生的新作品，及未使用华光于现在和将来提供之服务的情况下创作之作品（以下称“用户原创作品”），一旦在华光上传、发布、在享受网站服务中以任何方式使用以及实施任何其他类似行为，则用户均独家授予华光就用户原创作品、衍生作品在全球范围内、永久性、免费的使用权，华光可基于自身判断和需求将该等作品用于任何用途和目的，且无须向用户支付任何费用，而不论是否具有商业性质；但是，华光在该等使用中应为用户署名，如无特殊约定或客观条件造成的难以实现，署名为用户在华光注册的用户名。 用户保证华光衍生作品和用户原创作品均不侵犯任何人的合法权利，包括但不限于著作权、专利权、商标专用权、技术秘密等知识产权，肖像权、名誉权、姓名权等人格权等，且华光可以依照前述规定获得合法著作权和使用权。</p>
                    <h2>3．账号和密码</h2>
                    <p>用户使用电话号码或邮箱申请注册成功后，华光将分配给用户华光的账号。用户了解账号一旦设定，就不可再为变更；而密码则可以在华光的网页上进行变更。</p>
                    <p>为维护自身权益，用户不应将账号及密码泄漏或提供第三人知悉或出借或转让与他人使用，如因用户自身过错或过失而导致账号或密码泄漏而给用户自身造成损失，用户应自行承担责任。华光团队成员（包括但不限于我们的网站和网站管理人员、客服人员等）不会以任何方式询问用户的密码，所以用户不得对任何人泄漏用户的密码，不要多人共享同一个账号，不安装非法或来路不明的程序。如果用户遗失了密码，华光不承担任何后果。</p>
                    <p>若用户发现账号或密码遭他人非法使用或有异常使用的情形，应立即通知华光，并提交该账号为本人所有的有关证明，以便申请该账号的暂停使用，因此而造成的损失，华光不承担赔偿责任。但在用户根据法律规定申请立案的情况下，华光有义务协助查询。</p>
                    <h2>4.用户的权利</h2>
                    <p>用户可以根据本协议以及华光不时更新和公布的其他规则使用华光提供的服务。</p>
                    <p>用户有权在使用华光提供的服务的期间监督华光及华光的工作人员是否按照华光所公布的标准向用户提供服务，也可以随时向华光提出与华光的服务有关意见和建议。</p>
                    <p>如果用户不同意本协议或对华光后来更新的协议有异议，或对华光所提供服务不满意，用户可以选择停止使用华光的服务。如果用户选择停止使用华光的服务，则华光即不再对用户承担任何义务和责任。</p>
                    <h2>5．用户的义务</h2>
                    <p>用户需自行配备注册和使用网络所需的各项计算机及网络设备，并自行负担上网所需的各项费用。</p>
                    <p>用户知悉并理解，华光可能在现在和将来的任何时候向用户提供有偿服务，用户一旦使用该等有偿服务，应受其规则制约并支付相应费用。具体的有偿服务及其规则将经华光官网公布实施。</p>
                    <p>用户有义务妥善保管使用华光的账号及密码，在以正确的用户账号和密码登录的情况下，使用该账户的人即被视为用户本人，其所做出的任何行为也将视为用户的行为，用户应当为此账号及密码登入系统后所开始的一连串行为或活动负责。</p>
                    <p>用户在使用华光网络服务过程中，必须遵循以下原则：</p>
                    <p>（1）遵守中华人民共和国有关的法律和法规；</p>
                    <p>（2）不得为任何非法目的而使用网络服务系统；</p>
                    <p>（3）遵守所有与网络服务有关的网络协议、规定和程序；</p>
                    <p>（4）不会以任何可能损害、攻击、使服务器过度负荷或其他可能破坏华光所提供的服务；</p>
                    <p>（5）不得利用华光网络服务系统进行任何可能对互联网的正常运转造成不利影响或可能干扰他人以正常方式使用华光所提供的服务的方式使用华光的服务的行为；</p>
                    <p>（6）不得利用华光网络服务系统传输任何骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；</p>
                    <p>（7）不得利用华光网络服务系统进行其他不利于华光的行为；</p>
                    <p>（8）就华光及合作商业伙伴的服务、产品、业务咨询应采取相应机构提供的沟通渠道，不得在公众场合发布有关华光及相关服务的负面宣传；</p>
                    <p>（8）就华光及合作商业伙伴的服务、产品、业务咨询应采取相应机构提供的沟通渠道，不得在公众场合发布有关华光及相关服务的负面宣传；</p>
                    <p>（8）就华光及合作商业伙伴的服务、产品、业务咨询应采取相应机构提供的沟通渠道，不得在公众场合发布有关华光及相关服务的负面宣传；</p>
                    <p>（9）如发现任何非法使用用户账号或账号出现安全漏洞的情况，应立即通告华光。</p>
                    <h2>6．取消账号</h2>
                    <p>任何用户有如下任意一种或多种行为而导致其账号被取消，华光不承担任何责任：</p>
                    <p>（1）有违反本服务协议的行为；</p>
                    <p>（2）滥用所享受的权利；</p>
                    <p>（3）提供虚假注册信息；</p>
                    <p>（4）通过不正当手段使用华光网络服务；</p>
                    <p>（5）有损华光及其权利人、关系企业或合作对象的权益和其他用户合法权益的行为；</p>
                    <p>（6）违反中国的法律、法规；</p>
                    <p>（7）违背社会风俗和社会道德的行为；</p>
                    <p>（8）其他违反华光相关规定的行为。</p>
                    <h2>7.服务中断</h2>
                    <p>用户知悉并理解，华光有权在发生下列情形之一时中断所提供的网络服务，但应尽量在网站显著位置通知用户；确因客观原因无法提前通知的，华光应尽力将中断服务的时间缩短至最少或最大化减少不良影响。华光中断网络服务无须在法律允许的范围内向用户承担任何责任或仅依法承担最低限度的责任：</p>
                    <p>（1）定期或不定期地对华光的网络设备进行必要的保养及施工；</p>
                    <p>（2）因华光、华光的合作方或电信网络系统软硬件设备的故障、失灵或人为操作的疏失；</p>
                    <p>（3）他人侵入华光的网络，篡改、删改或伪造、编造网站数据；</p>
                    <p>（4）不可抗力原因；</p>
                    <p>（5）由于相关机构基于法律或法定程序的要求；</p>
                    <p>（6）其他基于法律或国家政策的规定。</p>
                    <h2>8．终止服务</h2>
                    <p>用户知悉并理解，华光有权基于自身需要及判断随时终止一项或多项服务，华光将在网站显著位置提前通知；其终止服务将无须在法律允许的范围内向用户承担任何责任或仅依法承担最低限度的责任。</p>
                    <h2>9．隐私保护</h2>
                    <p>保护用户（特别是未成年人）的隐私是华光的一项基本政策。因此，若父母（监护人）希望未成年人（尤其是十岁以下子女）得以使用本服务，必须以父母（监护人）名义申请注册，在接受本服务时，应以法定监护人身份加以判断本服务是否符合于未成年人。</p>
                    <p>华光将采取商业上合理的方式以保护用户的个人资料的安全。华光将使用通常可以获得的安全技术和程序来保护用户的个人资料不被未经授权的访问、使用或泄漏。对于非因华光的过错而造成用户账号的丢失或用户个人资料的泄密，华光将无须在法律允许的范围内向用户承担任何责任或仅依法承担最低限度的责任，其并将就保护用户隐私提供协助。</p>
                    <p>华光承诺在未获得用户的许可前，不会公开用户注册资料中的电话号码、电子邮箱、密码等。但如果出现下列情况将不在此承诺范围内：</p>
                    <p>（1）用户允许华光披露这些个人资料；</p>
                    <p>（2）有关法律法规或行政规章要求华光披露用户的个人资料；</p>
                    <p>（3）应相关司法机关或行政机关等国家机构的要求，华光为配合司法、行政程序的正常进行而披露用户资料；</p>
                    <p>（4）为保护华光的知识产权、名誉权及其他财产权益，需要向华光内部工作人员及第三方正当的权利主张人披露的，华光经审慎决策而披露用户的个人资料；</p>
                    <p>（5）在紧急情况下为保护其他用户和社会大众的人身安全，需要披露用户的个人资料；</p>
                    <p>（6）本公司合理怀疑有危害国家安全事情发生时，本公司主动将相关资料供公安机关调查处理；</p>
                    <p>（7）华光可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与华光同等的保护用户隐私的责任，则华光可将用户的注册资料等提供给该第三方。</p>
                    <p>用户知悉并理解，华光为提供网站服务、支持运营等客观原因将需要与第三方合作，在此情况下，用户同意如该第三方同意承担与华光同等的保护用户隐私的责任，则华光可将用户的个人信息等提供给该第三方。在保护用户个人隐私的前提下，华光有权对整个用户数据库进行技术分析并对已进行分析、整理后的用户数据库进行商业上的利用（包括但不限于公布、分析或以其它方式使用用户访问量、访问时段、用户偏好等用户数据信息）。 尽管华光对用户的隐私权保护做了极大的努力，但是仍然不能保证现有的安全技术措施使用户的技术信息等不受任何形式的损失。故用户在此同意并确认，任何由于计算机系统问题、黑客攻击、计算机病毒侵入或发作、因政府管制而造成的暂时性关闭等影响网络正常浏览的不可抗力而造成的用户个人信息泄露、丢失、被盗用或被篡改等，华光均无需承担责任。</p>
                    <h2>10．违约责任</h2>
                    <p>用户同意保障和维护华光及其他用户的利益，如因用户违反有关法律、法规或本协议项下的任何条款而给华光或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。</p>
                    <p>用户同意补偿华光的一切团队成员，因用户违反相关法律法规或本用户协议所产生之一切损害及责任。</p>
                    <h2>11．免责声明</h2>
                    <p>在适用法律允许的最大范围内，华光明确表示不提供任何其他类型的保证，不论是明示的或默示的，包括但不限于适销性、适用性、可靠性、准确性、完整性、无病毒以及无错误的任何默示保证和责任。</p>
                    <p>另外，在适用法律允许的最大范围内，华光并不担保华光所提供的服务一定能满足用户的要求，也不担保提供的服务不会被中断，并且对服务的及时性，安全性，出错发生，以及信息是否能准确，及时，顺利的传送均不作任何担保。</p>
                    <p>在适用法律允许的最大范围内，华光不就因用户使用华光的服务引起的，或在任何方面与华光的服务有关的任何意外的、非直接的、特殊的、或间接的损害或请求（包括但不限于因人身伤害、因隐私泄漏、因未能履行包括诚信或合理谨慎在内的任何责任、因过失和因任何其他金钱上的损失或其他损失而造成的损害赔偿）承担任何责任。</p>
                    <p>用户若反对任何服务协议的条款或对后来的协议的修改有异议，或对华光的服务不满，用户只有以下的追索权：</p>
                    <p>（1）不再使用华光服务；</p>
                    <p>（2）请求华光注销用户的华光账号；</p>
                    <p>（3）通告华光停止该用户接受华光网络服务的资格。</p>
                    <h2>12、法律管辖</h2>
                    <p>本产品及服务相关规范的解释及适用，以及用户因使用本产品及服务而与华光之间所产生的权利义务关系，应适用中华人民共和国法律（不含涉外民事法律适用法或其他类似法规）。因此所产生的争议，均应以华光人工智能教育机器人创新团队所在地法院为第一审管辖法院。此外，如果本协议的任何内容与法律相抵触，应以法律规定为准，同时华光将重新解释或修改相关的条款，而本协议的其他部分将保持对用户的法律效力。</p>
                    <h2>13．送达和通知</h2>
                    <p>本协议项下所有的通知均可通过重要页面公告、电子邮件或常规的信件传送等方式进行；该等通知于发送之日视为已送达收件人。</p>
                    <h2>14．其他规定</h2>
                    <p>本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的之外，未赋予本协议各方任何其他权利。</p>
                    <p>如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且对协议各方有约束力。</p>
                    <p>本服务条款执行过程中所产生的任何问题本网站和用户都将友好协商解决。</p>
                    <p>本协议中的标题仅为方便而设，不具法律或契约效果。</p>
                    <p>对用户协议的解释、修改及更新权均属于华光最终所有。</p>
                    <h2>15．本协议生效时间</h2>
                    <p>2021年3月9日—现在</p>
                    </div>
                </div>
            </div>

        );
    }
}


export default Protocol;